{
    "welcome": "This is the second version of a project repository website I made in 2020 to showcase the many small personal projects that I love to do. This page is from-scratch, vanilla HTML, CSS, and JavaScript, so I derived great joy from having complete control over the quality of the page you are currently viewing. Please feel free to browse the projects that are listed below and read about my personal journey and takeaways from each one. Also do not hesitate to reach out to me via the \"Contacts\" tab in the upper right corner of the screen with comments, questions, project ideas, or business inquiries. Enjoy the site! -Ben",
    "about": {
        "pics": ["Assets/PersonalPhoto.jpg"],
        "bio": [
            "Hello and thank you for visiting the page about me! In case you missed it, my name is Ben Wurster, and I am a junior at University of Wisconsin-Madison triple-majoring in Mechanical Engineering, Computer Science, and Mathematics. I have great passion for ideas and emerging technologies revolving around these subjects, and through my education I seek to attain the broad skill set necessary to add greater technical depth to my personal endeavors and to be involved in world-changing projects that can hopefully enhance the lives of countless people.",
            "As this site may suggest, one of my hobbies is the pursuit of small, personal projects to explore technology and make things that I think are pretty cool. I like to draw both from prinicples commonly found in computer science and programming as well as mechanics and physical design to hopefully do something unique. I seek to learn or apply a new or recently discovered skill in every project because I see each one as, at a deeper level, something carrying more weight than a small, insignificant project. Building a technical skill set takes time and effort. Each project is a point along the arc that brings me to where I want to be in the future: having the skills necessary to have a massive positive impact and influence in the world.",
            "Beyond projects, I engage in many other activities to lead a balanced lifestyle. I take great joy in being physically active. Recently, my passion for physical activity has found me running, biking, swimming, playing soccer, doing yoga, and lifing all multiple times within any given week. Put simply, I am happiest when exercising.",
            "Reading and listening to music are some other side interests of mine. Some of my favorite books are <i>Lifespan: Why We Age-and Why We Don't Have To</i> by David A. Sinclair, <i>Around the World in 80 Days</i> by Jules Verne, and <i>Brief Answers to Big Questions</i> by Stephen Hawking. You should actually check them out right now because they are phenomenal reads that have had some sort of significant impact on how I view the world! My favorite music genres are EDM, House, and some Rap. My friends think that it is insane that I can just vibe to EDM, but I think that it tunes me out of the world and lets me just go in my head for a while. It is a beautiful genre; anyone with a computer can make EDM which leads to the purest form of self expression from talented artists that can rise in low barrier to entry.",
            "So I guess there is a little bit about me. If you want to connect for any reason, look to the \"Contact\" tab in the menu above. I hope that you enjoy browsing this site as much as I did while making it.",
            "-Ben"
        ]
    }
}